app/views/widgets/_form.html.erb

SELECT "books".* FROM "books"
---
    <div class="controls">
      <%= f.collection_select :book_id, Book.all, :id, :title, prompt: true, :class => 'select_field' %>