app/views/books/_form.html.erb

    <div class="controls">
      <%= f.collection_select :book_template, BookTemplate.all, :title, :title, prompt: true, :class => 'select_field' %>
---
SELECT "book_templates".* FROM "book_templates"