app/controllers/books_controller.rb

  def index
    @books = Book.order("title").page(params[:page])
---
SELECT  "books".* FROM "books"   ORDER BY title LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "books"

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("book_template", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["book_template", "2"], ["created_at", "2014-05-28 17:55:43.601090"], ["title", "Livro 001"], ["updated_at", "2014-05-28 17:55:43.601090"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "pdf_version" = ?, "total_pages" = ?, "updated_at" = ? WHERE "books"."id" = 23  [["pdf_version", 1.3], ["total_pages", 311], ["updated_at", "2014-05-29 09:29:08.359352"]]