app/controllers/book_templates_controller.rb

SELECT "book_templates".* FROM "book_templates"
---
  def index
    @book_templates = BookTemplate.all

INSERT INTO "book_templates" ("book_qt", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["book_qt", 2.0], ["created_at", "2014-06-09 03:04:37.887765"], ["title", "Livro do Aluno"], ["updated_at", "2014-06-09 03:04:37.887765"]]
---
  def create
    @book_template = BookTemplate.new(book_template_params)

    respond_to do |format|
      if @book_template.save

DELETE FROM "book_templates" WHERE "book_templates"."id" = ?  [["id", 1]]
---
  def destroy
    @book_template.destroy

SELECT  "book_templates".* FROM "book_templates"  WHERE "book_templates"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_book_template
      @book_template = BookTemplate.find(params[:id])