app/controllers/book_configuration_controller.rb

SELECT  "books".* FROM "books"  WHERE "books"."id" = ? LIMIT 1  [["id", 24]]
UPDATE "books" SET "images_path" = ?, "updated_at" = ? WHERE "books"."id" = 24  [["images_path", "/Users/takabayashi/Desenvolvimento/projeto-gerador/gerador-pdf-interativo-v3/public/books/24/images"], ["updated_at", "2014-05-29 11:28:26.495750"]]
---
	def convert
		@book = Book.find(params[:id])

		dir_path = File.dirname(@book.file_path)

		full_path = File.join(dir_path, "images")
		if File.exists? full_path
			puts "Apagando pasta #{full_path} ..."
			FileUtils.rm_r(full_path, {force: true})
		end

		FileUtils.mkdir_p (full_path)

		puts "Convertendo arquivo pdf em images ..."

		progressbar = ProgressBar.create(:title => "Arquivos convertidos", :starting_at => 1, :total => @book.total_pages.to_i + 1)

		image = Magick::ImageList.new(@book.file_path) do
		  self.format = 'PDF'
		  self.quality = 100
		  self.density = 150
		end.each_with_index do |img, i|
			#img.resize_to_fit!(1496, 2008)
			img.write(File.join(full_path, "Page-#{i}.jpg"))

			progressbar.increment

SELECT  "books".* FROM "books"  WHERE "books"."id" = ? LIMIT 1  [["id", 24]]
---
	def configurate
		@book = Book.find(params[:id])

SELECT  "books".* FROM "books"  WHERE "books"."id" = ? LIMIT 1  [["id", 15]]
SELECT  "book_templates".* FROM "book_templates"  WHERE "book_templates"."title" = 'Livro do Aluno' LIMIT 1
SELECT  "book_templates".* FROM "book_templates"   ORDER BY "book_templates"."id" ASC LIMIT 1
---
	def build
		@book = Book.find(params[:id])
		temp_path = File.join(File.dirname(@book.file_path), 'temp')

		#copia o template correto
		template_archive = BookTemplate.find_by({title: @book.book_template}).file_path
		template_path = File.dirname(template_archive)
		unzip_package(template_archive, temp_path)

		#copia as imagens para o caminho correto
		images_path = File.join(File.dirname(@book.file_path), 'images', '*')