app/controllers/publishers_controller.rb

SELECT "publishers".* FROM "publishers"
---
  def index
    @publishers = Publisher.all

INSERT INTO "publishers" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-06-09 04:49:23.190034"], ["name", "Editora 1"], ["updated_at", "2014-06-09 04:49:23.190034"]]
---
  def create
    @publisher = Publisher.new(publisher_params)

    respond_to do |format|
      if @publisher.save

SELECT  "publishers".* FROM "publishers"  WHERE "publishers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_publisher
      @publisher = Publisher.find(params[:id])