app/controllers/widgets_controller.rb

SELECT "widgets".* FROM "widgets"
---
  def index
    @widgets = Widget.all

INSERT INTO "widgets" ("book_id", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 1], ["created_at", "2014-05-29 14:28:31.505599"], ["title", "Widget 001"], ["updated_at", "2014-05-29 14:28:31.505599"]]
---
  def create
    @widget = Widget.new(widget_params)

    respond_to do |format|
      if @widget.save

UPDATE "widgets" SET "full_path" = ?, "updated_at" = ? WHERE "widgets"."id" = 1  [["full_path", "/Users/takabayashi/Desenvolvimento/projeto-gerador/gerador-pdf-interativo-v3/public/widgets/1/widget.zip"], ["updated_at", "2014-05-29 14:44:43.099081"]]
---
  def update
    respond_to do |format|
      if @widget.update(widget_params)

DELETE FROM "widgets" WHERE "widgets"."id" = ?  [["id", 1]]
---
  def destroy
    @widget.destroy

SELECT  "widgets".* FROM "widgets"  WHERE "widgets"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_widget
      @widget = Widget.find(params[:id])